samples/ePA 1 Beispielnachrichten PS - Konnektor/Requests/removedocument.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:m0="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:m1="http://ws.gematik.de/conn/ConnectorCommon/v5.0" xmlns:m2="http://ws.gematik.de/fa/phr/v1.1">
  <soap:Header>
    <m:ContextHeader xmlns:m="http://ws.gematik.de/conn/phrs/PHRService/v1.3">
      <m0:Context>
        <m1:MandantId>Mandant1</m1:MandantId>
        <m1:ClientSystemId>ClientID1</m1:ClientSystemId>
        <m1:WorkplaceId>CATS</m1:WorkplaceId>
      </m0:Context>
      <m:RecordIdentifier>
        <m2:InsurantId root="1.2.276.0.76.4.8" extension="X110464500"/>
        <m2:HomeCommunityId>urn:oid:1.2.276.0.76.3.1.321.12.1.60.22</m2:HomeCommunityId>
      </m:RecordIdentifier>
    </m:ContextHeader>
    <Action xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2017:RemoveDocuments</Action>
    <To xmlns="http://www.w3.org/2005/08/addressing">http://10.11.218.161:80/fm/phrservice</To>
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">71246555-423e-43aa-befc-d01c1cd5906a</MessageID>
    <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
      <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
    </ReplyTo>
  </soap:Header>
  <soap:Body>
    <RemoveDocumentsRequest xmlns="urn:ihe:iti:rmd:2017">
      <DocumentRequest xmlns="urn:ihe:iti:xds-b:2007">
        <RepositoryUniqueId>1.2.276.0.76.3.1.321.12.1.60.22</RepositoryUniqueId>
        <DocumentUniqueId>1.2.840.113556.1.8000.2554.44495.1001.23153.18084.40404.16342811.3529600</DocumentUniqueId>
      </DocumentRequest>
    </RemoveDocumentsRequest>
  </soap:Body>
</soap:Envelope>
