simulator-integration-test/src/test/resources/soapHeaderValidator_testdata/messageidnamespace.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:To soapenv:mustUnderstand="true"
            >http://localhost:8888/xdstools3/sim/123/reg/rb</wsa:To>
        <wsb:MessageID soapenv:mustUnderstand="true" xmlns:wsb="http://www.w3.org/2005/08/address"
            >urn:uuid:B9E7A7BFB9931872871379887093391</wsb:MessageID>
        <wsa:Action soapenv:mustUnderstand="true"
            >urn:ihe:iti:2007:RegisterDocumentSet-b</wsa:Action>
    </soapenv:Header>
    <soapenv:Body>
        <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
        </lcm:SubmitObjectsRequest>
    </soapenv:Body>
</soapenv:Envelope>
