simulator-integration-test/src/test/resources/soapMessageValidator_testdata/singlechild.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">

    <soapenv:Body>
        <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">

        </lcm:SubmitObjectsRequest>
    </soapenv:Body>
</soapenv:Envelope>
